// 0. 프론트엔드 개발의 배경
// 1. 2000년대 웹의 모습
// 1.1 정적인 문서 위주의 환경(HTML+CSS)
// 1.2 2004년 Ajax, 2006 jQuery
// -> 서버에 직접 페이지를 요청하지 않고도 페이지 일부만 갱신할 수 있는 동적인 웹 시대가 열립니다.
// 1.3 애플리케이션의 규모가 커지면 커질수록 DOM 조작이 복잡해지고 유지보수가 어려워졌다는 점

// 2. 프레임워크, 웹을 개발하기 위한 기본적인 아키텍쳐가 적용된 프로그램
// 2.1 Angular (2010년), 구글
// 2.1.2 Javascript 기반, MVC(Model-View-Controller) 아키텍쳐
// 2.1.3 양방향 데이터 바인딩, 대규모 웹 애플리케이션에 특화된 설계 & 기능 제공
// 2.1.4 프로젝트 규모가 커질수록 데이터 흐름 추적 어려웠다. 프레임워크 굉장히 무거웠다. 성능적으로도 문제 발생

// 2.2 React (2013), 페이스북(현 메타)
// 2.2.1 페이스북 -> 앵귤러를 사용해서 개발
// 2.2.1.1 페이스북 뉴스 피드처럼 자주, 부분적으로 갱신되는 초대형 UI에서는 성능 문제가 발생
