// 1. 타입스크립트
// 1.1 자바스크립트에 타임(Type)을 추가한 언어
// 1.2 타입 -> 데이터의 종류를 의미해요.
// 1.3 타입스크립트는 자바스크립트의 슈퍼셋(superset)이다
// 1.3.1 슈퍼셋은 어떤 집합이나 시스템이 다른 집합이나 시스템을 모두 포함하면서도 추가적인 요소를 더 가지고 있는 것을 말함

// 1.2 마이크로 소프트사가 개발함
// 1.2.1 자바스크립ㅇ트보다 좀 더 정확하고 안정적인 코드를 작성할 수 있기 때문
// 1.2.2 자바스크립트는 굉장히 유연한 언어
// 1.2.3 타입스크립트는 자바스크립트에 타입을 추가함 -> 정적 타입
{
  let num: Number;
  // num = "A";
  // num = true;
  // num = []''

  num = 10;
}

// 웹에는 HTML, CSS, Javascript만 열려서, scss,sass,typescript 같은 걸 javascript로 변환시켜서 띄우는 것 변환시키는 게 컴파일러
// 컴파일러 - 변환하는 것
// 컴파일 - 변환이 되는 과정
